In [10]:
import os
import pandas as pd

master_df = pd.DataFrame()

for file in os.listdir(f'{os.getcwd()}/Car_Hire_Data'):
    master_df = pd.concat([master_df, pd.read_csv(f'./Car_Hire_Data/{file}')],  ignore_index=True)

master_df.to_csv('CarHireData.csv')

master_df.head()

,City,Car Type,Number of Passengers,Location,Supplier,Total Price,Price,Offer Rating
0,Dublin,Toyota Aygo,4.0,Shuttle,VIP Cars,57.0,15.0,9.2
1,Dublin,Toyota Aygo,4.0,Shuttle,Enjoy Travel,57.0,15.0,6.0
2,Dublin,Toyota Aygo,4.0,Shuttle,HolidayCars.com,57.0,15.0,8.2
3,Dublin,Toyota Aygo,4.0,Shuttle,EconomyBookings,60.0,15.0,3.8
4,Dublin,Toyota Aygo,4.0,Shuttle,Wisecars,62.0,16.0,9.2

In [11]:
master_df['Number of Passengers'] = master_df['Number of Passengers'].astype('Int64')

master_df['Total Price'] = master_df['Total Price'].astype('Int64')

master_df['Price'] = master_df['Price'].astype('Int64')

master_df.head()

,City,Car Type,Number of Passengers,Location,Supplier,Total Price,Price,Offer Rating
0,Dublin,Toyota Aygo,4,Shuttle,VIP Cars,57,15,9.2
1,Dublin,Toyota Aygo,4,Shuttle,Enjoy Travel,57,15,6.0
2,Dublin,Toyota Aygo,4,Shuttle,HolidayCars.com,57,15,8.2
3,Dublin,Toyota Aygo,4,Shuttle,EconomyBookings,60,15,3.8
4,Dublin,Toyota Aygo,4,Shuttle,Wisecars,62,16,9.2

In [12]:
master_df.to_csv('CarHireDataCleaned.csv', index=False)